// config/oids.js
module.exports = {
  system: {
    sysDescr: "1.3.6.1.2.1.1.1.0",
    sysUptime: "1.3.6.1.2.1.1.3.0",
  },

  aten: {
    root: "1.3.6.1.4.1.21317.1.3.2.2.2.1",
    map: {
      current: "1.3.6.1.4.1.21317.1.3.2.2.2.1.3.1.2.1", // "0.00"
      voltage: "1.3.6.1.4.1.21317.1.3.2.2.2.1.3.1.3.1", // "229.95"
      power: "1.3.6.1.4.1.21317.1.3.2.2.2.1.3.1.4.1", // "0.0000"
      energy: "1.3.6.1.4.1.21317.1.3.2.2.2.1.3.1.5.1", // "164.7706" (kWh)
      outletBase: "1.3.6.1.4.1.21317.1.3.2.2.2.1.5.1.2.1..8", // + .1..8
    },
  },

  cyberpower: {
    root: "1.3.6.1.4.1.3808.1.1.3",

    map: {
      // ✅ ค่าหลัก (ใช้ index .1)
      voltage: "1.3.6.1.4.1.3808.1.1.3.2.3.1.1.6.1", // 2194 -> 219.4V
      current: "1.3.6.1.4.1.3808.1.1.3.2.3.1.1.7.1", // 1810 -> 18.10A
      power: "1.3.6.1.4.1.3808.1.1.3.2.3.1.1.8.1", // 1860 -> 1860W
      energy: "1.3.6.1.4.1.3808.1.1.3.2.3.1.1.10.1", // 40488 -> 404.88kWh

      // ✅ สถานะปลั๊ก (1..8)
      outletBase: "1.3.6.1.4.1.3808.1.1.3.3.4.1.1.4.1..8", // 0=OFF, 3=ON
    },

    scale: {
      voltage: 0.1, // ÷10
      current: 0.01, // ÷100
      power: 1,     // ตามที่เห็นน่าจะเป็น W ตรง
      energy: 0.01, // ÷100 => kWh
    },
  },

  apc: {
    root: "1.3.6.1.4.1.318.1.1.12",
    map: {
      // 1. Current: มี OID จริง (ค่ามาเป็น int ต้อง /10 ใน logic)
      current: "1.3.6.1.4.1.318.1.1.12.2.3.1.1.2.1",

      // 2. Voltage: ไม่มี OID จริง (ใช้ค่าคงที่ 220V หรือ 230V ตามไฟ Data Center)
      // แนะนำให้ใส่เป็น null หรือ string พิเศษ เพื่อให้ logic รู้ว่าต้อง Fix ค่า
      voltage: "FIXED_220",

      // 3. Power: คำนวณจาก Voltage * Current
      power: "CALCULATED",

      // 4. Energy: รุ่นนี้ไม่เก็บ Energy สะสม (Accumulated kWh)
      // แนะนำให้ใส่ 0 หรือ null
      energy: null,

      // 5. Outlet Base
      outletBase: "1.3.6.1.4.1.318.1.1.12.3.3.1.1.4",
    },
  },

};