// config/oids.js (CommonJS)

module.exports = {
  system: {
    sysDescr: "1.3.6.1.2.1.1.1.0",
    sysUptime: "1.3.6.1.2.1.1.3.0",
  },

 aten: {
  root: "1.3.6.1.4.1.21317.1.3.2.2.2.1",
  map: {
    current: "1.3.6.1.4.1.21317.1.3.2.2.2.1.3.1.2.1",
    voltage: "1.3.6.1.4.1.21317.1.3.2.2.2.1.3.1.3.1",
    power:   "1.3.6.1.4.1.21317.1.3.2.2.2.1.3.1.4.1",
    energy:  "1.3.6.1.4.1.21317.1.3.2.2.2.1.3.1.5.1",

    // ✅ ตัวจริงจากที่คุณ walk มา
    outletStatusBase: "1.3.6.1.4.1.21317.1.3.2.2.2.1.5.1.2",
  },
},

 cyberpower: {
  root: "1.3.6.1.4.1.3808.1.1.3",
  map: {
    voltage: "1.3.6.1.4.1.3808.1.1.3.2.3.1.1.6.1",
    current: "1.3.6.1.4.1.3808.1.1.3.2.3.1.1.7.1",
    power:   "1.3.6.1.4.1.3808.1.1.3.2.3.1.1.8.1",
    energy:  "1.3.6.1.4.1.3808.1.1.3.2.3.1.1.10.1",

    // ✅ เพิ่ม 2 ตัวนี้
    outletPowerBase:   "1.3.6.1.4.1.3808.1.1.3.3.5.1.1.8",
    outletCurrentBase: "1.3.6.1.4.1.3808.1.1.3.3.5.1.1.7",

    outletBase: "1.3.6.1.4.1.3808.1.1.3.3.4.1.1.4.1",
  },
  scale: {
    voltage: 0.1,
    current: 0.01,
    power: 1,
    energy: 0.01,
  },
},

  // ✅ BAWORN / RMCARD205 (12 outlets)
  baworn: {
    root: "1.3.6.1.4.1.3808.1.1.5",
    map: {
      // Volt (จากที่คุณได้จริง)
      voltage: "1.3.6.1.4.1.3808.1.1.5.3.2.0", // INTEGER: 230 => 230V

      // ✅ Amp raw (จากที่คุณ sniff แล้วเปลี่ยนตามโหลด)
      // ตัวอย่าง: 22, 10 (ดูเหมือนหน่วย 0.01A)
      current: "1.3.6.1.4.1.3808.1.1.5.5.2.4.1.3.1",

      // ✅ Watt raw (จากที่คุณ sniff แล้วเปลี่ยนตามโหลด)
      // ตัวอย่าง: 288, 117 (ดูเหมือน W ตรง)
      power: "1.3.6.1.4.1.3808.1.1.5.5.2.4.1.5.1",

      // 12 outlets: + .1..12 (ค่า 1/2)
      outletBase: "1.3.6.1.4.1.3808.1.1.5.6.3.1.3",
    },

    scale: {
      voltage: 1,     // 230 => 230V
      current: 0.01,  // 22 => 0.22A (จากแพทเทิร์นที่คุณเจอ)
      power: 1,       // 117 => 117W
    },
  },

  apc: {
    root: "1.3.6.1.4.1.318.1.1.12",
    map: {
      current: "1.3.6.1.4.1.318.1.1.12.2.3.1.1.2.1",
      voltage: "FIXED_220",
      power: "CALCULATED",
      energy: null,
      outletBase: "1.3.6.1.4.1.318.1.1.12.3.3.1.1.4",
    },
  },
};